#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/koisland/aws_terraform_smk_pipeline/runs/run-jUqBNRt5Fk8detfe

Waiting for the plan to start...

Terraform v1.4.4
on linux_amd64
Initializing plugins and modules...
module.snakemake.module.lambda_function.data.external.archive_prepare[0]: Refreshing...
module.snakemake.module.lambda_function.data.external.archive_prepare[0]: Refresh complete after 0s [id=-]
module.snakemake.module.lambda_function.local_file.archive_plan[0]: Refreshing state... [id=99eb4ff7d476736ae2c6317a21e66037a444efd4]
module.snakemake.module.lambda_function.null_resource.archive[0]: Refreshing state... [id=331195757321431686]
module.snakemake.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0]: Refreshing state... [id=3105578620750780756]
module.snakemake.aws_s3_bucket_versioning.output_versioning: Refreshing state... [id=snakemake-output]
module.snakemake.aws_s3_bucket_server_side_encryption_configuration.output_encryption: Refreshing state... [id=snakemake-output]
module.snakemake.aws_s3_bucket_public_access_block.output_access: Refreshing state... [id=snakemake-output]
module.snakemake.module.s3_smk_input.data.aws_caller_identity.current: Refreshing...
module.snakemake.module.s3_smk_input.data.aws_region.current: Refreshing...
module.snakemake.module.s3_notification.data.aws_partition.this: Refreshing...
module.snakemake.module.lambda_function.data.aws_partition.current: Refreshing...
module.snakemake.aws_s3_bucket.output: Refreshing state... [id=snakemake-output]
module.snakemake.module.s3_notification.data.aws_partition.this: Refresh complete after 0s [id=aws]
module.snakemake.aws_iam_role.ec2_role: Refreshing state... [id=snakemake_ec2_role]
module.snakemake.module.s3_smk_input.data.aws_region.current: Refresh complete after 0s [id=us-west-1]
module.snakemake.module.lambda_function.data.aws_region.current: Refreshing...
module.snakemake.module.lambda_function.data.aws_partition.current: Refresh complete after 0s [id=aws]
module.snakemake.module.lambda_function.data.aws_region.current: Refresh complete after 0s [id=us-west-1]
module.snakemake.aws_iam_role.batch_role: Refreshing state... [id=snakemake_batch_role]
module.snakemake.aws_iam_role.ecs_job_role: Refreshing state... [id=snakemake_ecs_job_role]
module.snakemake.module.s3_smk_output.data.aws_canonical_user_id.this: Refreshing...
module.snakemake.data.aws_vpc.default: Refreshing...
module.snakemake.module.s3_smk_input.data.aws_caller_identity.current: Refresh complete after 0s [id=985118252342]
module.snakemake.data.aws_subnets.default: Refreshing...
module.snakemake.module.lambda_function.data.aws_caller_identity.current: Refreshing...
module.snakemake.module.lambda_function.data.aws_caller_identity.current: Refresh complete after 0s [id=985118252342]
module.snakemake.module.s3_smk_output.data.aws_caller_identity.current: Refreshing...
module.snakemake.module.s3_smk_input.data.aws_canonical_user_id.this: Refreshing...
module.snakemake.module.s3_smk_output.data.aws_caller_identity.current: Refresh complete after 0s [id=985118252342]
module.snakemake.module.s3_smk_output.data.aws_region.current: Refreshing...
module.snakemake.module.s3_smk_output.data.aws_region.current: Refresh complete after 0s [id=us-west-1]
module.snakemake.module.lambda_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/snakemake-lambda]
module.snakemake.module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Refreshing...
module.snakemake.module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Refresh complete after 0s [id=3693445097]
module.snakemake.aws_iam_role_policy_attachment.batch_policy_attachment: Refreshing state... [id=snakemake_batch_role-20230401230713778100000001]
module.snakemake.aws_iam_role_policy_attachment.ec2_policy_attachment: Refreshing state... [id=snakemake_ec2_role-20230401225534221400000002]
module.snakemake.aws_iam_instance_profile.ec2_profile: Refreshing state... [id=snakemake_ec2_profile]
module.snakemake.aws_batch_job_definition.standard: Refreshing state... [id=arn:aws:batch:us-west-1:985118252342:job-definition/snakemake_standard:2]
module.snakemake.module.lambda_function.aws_iam_role.lambda[0]: Refreshing state... [id=snakemake-lambda]
module.snakemake.aws_iam_policy.read_write_s3: Refreshing state... [id=arn:aws:iam::985118252342:policy/snakemake_read_write_s3]
module.snakemake.aws_iam_role_policy_attachment.s3_access_policy_attachment: Refreshing state... [id=snakemake_ecs_job_role-20230401225536437700000004]
module.snakemake.data.aws_subnets.default: Refresh complete after 0s [id=us-west-1]
module.snakemake.module.s3_smk_output.data.aws_canonical_user_id.this: Refresh complete after 0s [id=c5538806afc2ce23d5b0967eedde1ce498332e41b65ada00732f2b743fe15dc2]
module.snakemake.module.lambda_function.data.aws_iam_policy_document.logs[0]: Refreshing...
module.snakemake.module.lambda_function.data.aws_iam_policy_document.logs[0]: Refresh complete after 0s [id=1885350019]
module.snakemake.module.lambda_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::985118252342:policy/snakemake-lambda-logs]
module.snakemake.module.s3_smk_input.data.aws_canonical_user_id.this: Refresh complete after 0s [id=c5538806afc2ce23d5b0967eedde1ce498332e41b65ada00732f2b743fe15dc2]
module.snakemake.module.lambda_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=snakemake-lambda-20230401225534823500000003]
module.snakemake.module.lambda_function.aws_lambda_function.this[0]: Refreshing state... [id=snakemake-lambda]
module.snakemake.data.aws_vpc.default: Refresh complete after 1s [id=vpc-96b76df0]
module.snakemake.aws_security_group.batch_standard: Refreshing state... [id=sg-06e55f841aab62a9c]
module.snakemake.aws_batch_compute_environment.standard: Refreshing state... [id=snakemake_standard]
module.snakemake.module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromS3Bucket"]: Refreshing state... [id=AllowExecutionFromS3Bucket]
module.snakemake.module.lambda_function.aws_lambda_permission.current_version_triggers["AllowExecutionFromS3Bucket"]: Refreshing state... [id=AllowExecutionFromS3Bucket]
module.snakemake.module.s3_notification.aws_lambda_permission.allow["lambda1"]: Refreshing state... [id=AllowLambdaS3BucketNotification-20230401232047872400000001]
module.snakemake.aws_batch_job_queue.main_queue: Refreshing state... [id=arn:aws:batch:us-west-1:985118252342:job-queue/snakemake_main_queue]
module.snakemake.module.s3_notification.aws_s3_bucket_notification.this[0]: Refreshing state... [id=snakemake-output]
module.snakemake.module.lambda_function.local_file.archive_plan[0]: Drift detected (delete)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.snakemake.aws_iam_policy.read_write_s3 will be updated in-place
  ~ resource "aws_iam_policy" "read_write_s3" {
        id        = "arn:aws:iam::985118252342:policy/snakemake_read_write_s3"
        name      = "snakemake_read_write_s3"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:PutObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::snakemake-output/*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "created-by" = "terraform"
        }
        # (4 unchanged attributes hidden)
    }

  # module.snakemake.aws_s3_bucket.output will be destroyed
  # (because aws_s3_bucket.output is not in configuration)
  - resource "aws_s3_bucket" "output" {
      - arn                         = "arn:aws:s3:::snakemake-output" -> null
      - bucket                      = "snakemake-output" -> null
      - bucket_domain_name          = "snakemake-output.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "snakemake-output.s3.us-west-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z2F56UZL2M1ACD" -> null
      - id                          = "snakemake-output" -> null
      - object_lock_enabled         = false -> null
      - region                      = "us-west-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null

      - grant {
          - id          = "c5538806afc2ce23d5b0967eedde1ce498332e41b65ada00732f2b743fe15dc2" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - kms_master_key_id = "arn" -> null
                  - sse_algorithm     = "aws:kms" -> null
                }
            }
        }

      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }
    }

  # module.snakemake.aws_s3_bucket_public_access_block.output_access will be destroyed
  # (because aws_s3_bucket_public_access_block.output_access is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "output_access" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "snakemake-output" -> null
      - id                      = "snakemake-output" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

  # module.snakemake.aws_s3_bucket_server_side_encryption_configuration.output_encryption will be destroyed
  # (because aws_s3_bucket_server_side_encryption_configuration.output_encryption is not in configuration)
  - resource "aws_s3_bucket_server_side_encryption_configuration" "output_encryption" {
      - bucket = "snakemake-output" -> null
      - id     = "snakemake-output" -> null

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - kms_master_key_id = "arn" -> null
              - sse_algorithm     = "aws:kms" -> null
            }
        }
    }

  # module.snakemake.aws_s3_bucket_versioning.output_versioning will be destroyed
  # (because aws_s3_bucket_versioning.output_versioning is not in configuration)
  - resource "aws_s3_bucket_versioning" "output_versioning" {
      - bucket = "snakemake-output" -> null
      - id     = "snakemake-output" -> null

      - versioning_configuration {
          - status = "Enabled" -> null
        }
    }

  # module.snakemake.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/fc04166815f266914d9624a703259f5512a879c27b7af491aa45c8c85a4beb8c.zip" -> "builds/e0834cd2a00fabe9bba44e2c355199ca36f20110345e39cff2400199b54ef61a.zip"
        id                             = "snakemake-lambda"
      ~ last_modified                  = "2023-04-01T23:20:48.297+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-1:985118252342:function:snakemake-lambda:1" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-1:985118252342:function:snakemake-lambda:1/invocations" -> (known after apply)
        tags                           = {
            "created-by" = "terraform"
        }
      ~ version                        = "1" -> (known after apply)
        # (18 unchanged attributes hidden)

      + environment {
          + variables = {
              + "job_def"   = "snakemake_standard"
              + "job_queue" = "snakemake_main_queue"
            }
        }

      ~ tracing_config {
          ~ mode = "PassThrough" -> "Active"
        }

        # (1 unchanged block hidden)
    }

  # module.snakemake.module.lambda_function.aws_lambda_permission.current_version_triggers["AllowExecutionFromS3Bucket"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "AllowExecutionFromS3Bucket" -> (known after apply)
      ~ qualifier           = "1" # forces replacement -> (known after apply)
      ~ source_arn          = "arn:aws:s3:::snakemake-output" # forces replacement -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.snakemake.module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromS3Bucket"] must be replaced
-/+ resource "aws_lambda_permission" "unqualified_alias_triggers" {
      ~ id                  = "AllowExecutionFromS3Bucket" -> (known after apply)
      ~ source_arn          = "arn:aws:s3:::snakemake-output" # forces replacement -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.snakemake.module.lambda_function.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "pip",
                      + "python3.8",
                      + "modules/snakemake/lambda_py/requirements.txt",
                      + null,
                      + null,
                    ],
                  + [
                      + "zip",
                      + "modules/snakemake/lambda_py",
                      + null,
                    ],
                ]
              + filename      = "builds/e0834cd2a00fabe9bba44e2c355199ca36f20110345e39cff2400199b54ef61a.zip"
              + runtime       = "python3.8"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/e0834cd2a00fabe9bba44e2c355199ca36f20110345e39cff2400199b54ef61a.plan.json"
      + id                   = (known after apply)
    }

  # module.snakemake.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "331195757321431686" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/fc04166815f266914d9624a703259f5512a879c27b7af491aa45c8c85a4beb8c.zip" -> "builds/e0834cd2a00fabe9bba44e2c355199ca36f20110345e39cff2400199b54ef61a.zip"
          ~ "timestamp" = "1680418586410520000" -> "1680424300367444000"
        }
    }

  # module.snakemake.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "3105578620750780756" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/fc04166815f266914d9624a703259f5512a879c27b7af491aa45c8c85a4beb8c.zip" -> "builds/e0834cd2a00fabe9bba44e2c355199ca36f20110345e39cff2400199b54ef61a.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.snakemake.module.s3_notification.aws_lambda_permission.allow["lambda1"] must be replaced
-/+ resource "aws_lambda_permission" "allow" {
      ~ id                  = "AllowLambdaS3BucketNotification-20230401232047872400000001" -> (known after apply)
      ~ source_arn          = "arn:aws:s3:::snakemake-output" # forces replacement -> (known after apply)
      ~ statement_id        = "AllowLambdaS3BucketNotification-20230401232047872400000001" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.snakemake.module.s3_notification.aws_s3_bucket_notification.this[0] must be replaced
-/+ resource "aws_s3_bucket_notification" "this" {
      ~ bucket      = "snakemake-output" # forces replacement -> (known after apply)
      ~ id          = "snakemake-output" -> (known after apply)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.snakemake.module.s3_smk_input.aws_s3_bucket.this[0] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "snakemake_input"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = false
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.snakemake.module.s3_smk_input.aws_s3_bucket_acl.this[0] will be created
  + resource "aws_s3_bucket_acl" "this" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # module.snakemake.module.s3_smk_input.aws_s3_bucket_public_access_block.this[0] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.snakemake.module.s3_smk_input.aws_s3_bucket_server_side_encryption_configuration.this[0] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "arn"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.snakemake.module.s3_smk_input.aws_s3_bucket_versioning.this[0] will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.snakemake.module.s3_smk_output.aws_s3_bucket.this[0] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "snakemake_output"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = false
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.snakemake.module.s3_smk_output.aws_s3_bucket_acl.this[0] will be created
  + resource "aws_s3_bucket_acl" "this" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # module.snakemake.module.s3_smk_output.aws_s3_bucket_public_access_block.this[0] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.snakemake.module.s3_smk_output.aws_s3_bucket_server_side_encryption_configuration.this[0] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "arn"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.snakemake.module.s3_smk_output.aws_s3_bucket_versioning.this[0] will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 17 to add, 2 to change, 10 to destroy.

```

</details>

*Pushed by: @koisland, Action: `pull_request`*